// *****************************************************************************
// Напишите программу, проверяющую число, введенное с клавиатуры на четность. 
// Домашнее задание. ДЗ #2 | C++ для начинающих | 
// -----------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -----------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2022-2023 @ sgiman
// *****************************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");

	cout << "*********** PARITY ***********" << endl;

	int var;
	cout << "Ввелите число для проверки на четность: ";
	cin >> var;

	if (var % 2 == 0) // проверка остатка от деления  
	{
		cout << "число " << var << " четное!" << endl;
	}
	else
	{
		cout << "число " << var << " нечетное!" << endl;
	}

	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}